In [2]:
import pandas as pd
a=pd.Series([1,10,100,1000,10000])
print(a)

0        1
1       10
2      100
3     1000
4    10000
dtype: int64

In [3]:
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [24, 30, 22],
    "City": ["Delhi", "Mumbai", "Chennai"]
}
a=pd.DataFrame(data)
print(a)

      Name  Age     City
0    Alice   24    Delhi
1      Bob   30   Mumbai
2  Charlie   22  Chennai

In [5]:
a=pd.Series([85, 90, 78, 92, 88])
print(a)
print(a[2])

0    85
1    90
2    78
3    92
4    88
dtype: int64
78

In [10]:
subjects = ["Math", "Science", "English", "History", "Computer"]
scores = [95, 88, 76, 90, 85]
a=pd.Series(scores,index=subjects)
print(a["English"])

76

In [12]:
data = {
    "Product": ["Laptop", "Phone", "Tablet"],
    "Price": [50000, 20000, 15000],
    "Quantity": [5, 10, 8]
}
a=pd.DataFrame(data)
print(a)
print(a["Price"])

  Product  Price  Quantity
0  Laptop  50000         5
1   Phone  20000        10
2  Tablet  15000         8
0    50000
1    20000
2    15000
Name: Price, dtype: int64

In [20]:
student={
    "Name":["maqu","Hus","swal","akash"],
    "Age":[20,21,21,24],
    "Score":[100,90,90,90]
}
a=pd.DataFrame(student)
print(a)
print(a[["Name","Score"]])
a.info()
a.describe()
a.tail(1)

    Name  Age  Score
0   maqu   20    100
1    Hus   21     90
2   swal   21     90
3  akash   24     90
    Name  Score
0   maqu    100
1    Hus     90
2   swal     90
3  akash     90
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Score   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

    Name  Age  Score
3  akash   24     90

In [49]:
a=pd.Series([100, 200, 300, 400, 500])
print(a)
print(a[3])
print(a.shape)

0    100
1    200
2    300
3    400
4    500
dtype: int64
400
(5,)

In [46]:
data = {
    "Country": ["India", "USA", "UK", "Japan"],
    "Capital": ["Delhi", "Washington", "London", "Tokyo"],
    "Population": [1400, 331, 67, 125]
}
a=pd.DataFrame(data)
print(a["Capital"])

0         Delhi
1    Washington
2        London
3         Tokyo
Name: Capital, dtype: object

In [50]:
import numpy as np
import pandas as pd
a=np.arange(1,13).reshape(3,4)
b=pd.DataFrame(a,columns=["A", "B", "C", "D"])
print(b)
print(b.columns)
print(b.shape)

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12
Index(['A', 'B', 'C', 'D'], dtype='object')
(3, 4)

In [38]:
import pandas as pd

# Step 1: Create DataFrame
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Marks": [85, 92, 78, 88],
    "Grade": ["B", "A", "C", "B"]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

# Step 2: Save DataFrame to CSV file
df.to_csv("students.csv", index=False)   # index=False → don’t save row numbers

# Step 3: Read DataFrame back from CSV
df2 = pd.read_csv("students.csv")
print("\nDataFrame read from CSV:")
print(df2)

Original DataFrame:
      Name  Marks Grade
0    Alice     85     B
1      Bob     92     A
2  Charlie     78     C
3    David     88     B

DataFrame read from CSV:
      Name  Marks Grade
0    Alice     85     B
1      Bob     92     A
2  Charlie     78     C
3    David     88     B

In [51]:
a=pd.Series([1,2,3,4,5,6,7,8,9,10])
print(a)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [52]:
df1={
    "Name":["maqu","rasi"],
    "age":[10,20]
}
a=pd.DataFrame(df1)
a

   Name  age
0  maqu   10
1  rasi   20

In [53]:
df1={
    "Name":["maqu","rasi"],
    "age":[10,20]
}
a=pd.DataFrame(df1)
a=a.rename(columns={"Name":"col1","age":"col2"})
a

   col1  col2
0  maqu    10
1  rasi    20

In [ ]:
a=pd.Series([1,2,3,4,5,6])